brew "autojump" # directory changer
brew "direnv" # ENV vars by directory
brew "neovim"
brew "fzf"
# brew "geckodriver" # firefox webdriver fo selenium
# brew "nodenv"
# brew "rbenv"

cask_args appdir: "/Applications"
tap "caskroom/cask"

# must haves
cask "alfred" # awesome spotlight replacement
cask "caffeine" # stay awake mac
cask "iterm2"
cask "licecap" # gifs
cask "postman"
cask "slack"
cask "spectacle" # window management keybindings
cask "virtualbox"

# Misc
# cask "duet"
cask "google-chrome"
# cask "firefox"
# cask "opera"
# cask "zoomus" # conference calls

# coding
# cask "anaconda"
# cask "expo-xde" # react-native dev made easy

# music
# cask "amazon-music"
# cask "spotify"
cask "deezer"

# editors
cask "atom"
# cask "visual-studio-code"

# Spacemacs
# tap "d12frosted/emacs-plus"
# brew "emacs-plus", args: ['HEAD', 'with-natural-title-bars'], link: true

# git clone https://github.com/syl20bnr/spacemacs ~/.emacs.d
