brew "autojump" # directory changer
brew "direnv" # ENV vars by directory
brew "geckodriver" # firefox webdriver fo selenium
# brew "nodenv"
# brew "rbenv"

cask_args appdir: "/Applications"
tap "caskroom/cask"

cask "alfred" # awesome spotlight replacement
cask "amazon-music"
cask "caffeine" # stay awake mac
cask "expo-xde" # react-native dev made easy
cask "firefox"
cask "iterm2"
cask "opera"
cask "postman"
cask "slack"
cask "spectacle" # window management keybindings
cask "virtualbox"
cask "visual-studio-code"
cask "zoomus" # conference calls

# Spacemacs
tap "d12frosted/emacs-plus"
brew "emacs-plus", args: ['HEAD', 'with-natural-title-bars'], link: true

# git clone https://github.com/syl20bnr/spacemacs ~/.emacs.d
